Revit 2027 API
FillGrid(FillGrid) Constructor
 Constructs a new FillGrid with default settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FillGrid(
	FillGrid other
)
Public Sub New (
	other As FillGrid
)
public:
FillGrid(
	FillGrid^ other
)
new :
        other : FillGrid -> FillGrid
Parameters
other FillGrid
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FillGrid Class
FillGrid Overload
Autodesk.Revit.DB Namespace